## [foo/dolor/prod](https://omicron7.app.spacelift.io/stack/foo-dolor-prod/run/01HRWNPY5TQ1QZMXVTB6CEJM2G) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HRW4CE64PQAF41ST486DCG5R] Planning changes with 0 custom hooks...
tls_private_key.private_key: Refreshing state... [id=d1e44b0ae48586fdfdeab943b54e149ec112746a]
data.spacelift_stack.ansible: Reading...
data.spacelift_stack.ansible: Read complete after 0s [id=spacelift-ansible]
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 1s [id=ami-080e1f13689e07408]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.instances[0] will be created
  + resource "aws_instance" "instances" {
      + ami                                  = "ami-080e1f13689e07408"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "spacelift-test-prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "spacelift-test-0"
        }
      + tags_all                             = {
          + "Name"       = "spacelift-test-0"
          + "managed_by" = "terraform"
          + "owner"      = "devops-engineering-team@cru.org"
          + "terraform"  = "/mnt/workspace/source/foo/dolor/prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.ssh_key will be created
  + resource "aws_key_pair" "ssh_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "spacelift-test-prod"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDRiWLLuYFlg74m509OcYtJ1Zn+3qwv1hPBuzZRL0z4sXIG4z1YSsPpm1nFcTq7yVuHmdECgOslVnuHlvsFzxKhpwNssmAzV1zo2d8s4QoPyAj+Ck/K2C8wZGObF6gj5/gf3js2TSVRckaHZ3sSlCiBNbI23/IziSUzi3yX9bD635GXevBSqxaQbmleQuGoZS7XLSwE7rJJsZrCrbjbpL+1wchhwVI+usKt3JwO6wuERj7Fd2oi0jg3gAloeIYx0O2NCR4zWVB3IwzjhE7DrkpMq4eQrMIltyTw9YmHQnaJV58u3YHnmMBLeOshqRL+thHT2L5dJWY7qPEw6wp/m/C8Xn3i4etopQkENj0OCKJqgSOLzoZ9HFpkJPuhIejoU7Bu0R6xc4Vx9hccGYyQApo09rDgBOm43sb7TxE5jucFiPa/vu9PWU2GGPjlO0g+TSpXTZzZw3axCtk0Z039e1IpuGaX6I1Ma1JqxRfUgCDLrajO6XPClnr23BHgcIi1USJKzSen8pEgB87fSBU5OoGomqAwc6OPUTv83gGdHPEYXx8nyVmOPWR76b8O8z5qsEI3UX/wuAXUQqzFY69fty1YoDZ9BokV0NYrbykh8rmPIl2TdNMgcpSC7j0PY9/9C6WDDN4Yo5uyFFm9Dj33ZEwJk1Od6ONPnRXcWP1ifXXN3Q=="
      + tags_all        = {
          + "Name"       = "spacelift-test"
          + "managed_by" = "terraform"
          + "owner"      = "devops-engineering-team@cru.org"
          + "terraform"  = "/mnt/workspace/source/foo/dolor/prod"
        }
    }

  # spacelift_mounted_file.private_key will be created
  + resource "spacelift_mounted_file" "private_key" {
      + checksum      = (known after apply)
      + content       = (sensitive value)
      + context_id    = "spacelift-ansible"
      + id            = (known after apply)
      + relative_path = "id_rsa"
      + write_only    = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_instances = [
      + (known after apply),
    ]
[01HRW4CE64PQAF41ST486DCG5R] Changes are GO
[01HRW4CE64PQAF41ST486DCG5R] Uploading the list of managed resources...
[01HRW4CE64PQAF41ST486DCG5R] Please be aware that the run changes calculation includes output changes.
[01HRW4CE64PQAF41ST486DCG5R] Resource list upload is GO
[01HRW4CE64PQAF41ST486DCG5R] Generating JSON representation of the plan...
[01HRW4CE64PQAF41ST486DCG5R] JSON representation is GO
[01HRW4CE64PQAF41ST486DCG5R] Loading custom plan policy inputs...
[01HRW4CE64PQAF41ST486DCG5R] 0 custom plan policy inputs found
[01HRW4CE64PQAF41ST486DCG5R] No plan policies to evaluate
```

</details>